Процедура ПриКомпоновкеРезультата(
		ПараметрыОтчета, КомпоновщикНастроек, КомпоновщикМакета,
		ИсполнительКомпоновки, ДанныеРасшифровки, ФабрикаXDTO) Экспорт

	Схема = КомпоновщикНастроек.Схема;
	НаборДанных = Схема.НаборыДанных.Найти("НаборДанных1");
	НаборДанных.Запрос = ПартнерыИКонтрагенты.КАМИ_ТекстЗапросаРассрочкаКонтрагента();

	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		Схема, НастройкиКомпоновки, ДанныеРасшифровки, ФабрикаXDTO);
	ИсполнительКомпоновки.Выполнить(
		МакетКомпоновки, НастройкиКомпоновки,
		ПараметрыОтчета.ТабличныйДокумент, ДанныеРасшифровки,
		Тип("ГрафическаяСхема"));

КонецПроцедуры
